; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v8)
		(pred_4 ?v6)
		(pred_5 ?v1)
		(pred_2 ?v1)
		(pred_1 ?v6 ?v1)
		(pred_6)
		(pred_3 ?v6))

   (:action op_1
       :parameters  (?v7 ?v4)
       :precondition (and (not-eq ?v7 ?v4) 
                          (pred_5 ?v7) (pred_5 ?v4) (pred_2 ?v7))
       :effect (and  (pred_2 ?v4)
		     (not (pred_2 ?v7))))


   (:action op_3
       :parameters (?v5 ?v2)
       :precondition  (and  (pred_4 ?v5) (pred_5 ?v2)
			    (pred_1 ?v5 ?v2) (pred_2 ?v2) (pred_6))
       :effect (and (pred_3 ?v5)
		    (not (pred_1 ?v5 ?v2)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v5  ?v2)
       :precondition  (and  (pred_4 ?v5) (pred_5 ?v2)
			    (pred_3 ?v5) (pred_2 ?v2))
       :effect (and (pred_1 ?v5 ?v2)
		    (pred_6)
		    (not (pred_3 ?v5)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_03 obj_02 obj_04 
          obj_01 obj_05 
)
(:init
(pred_5 obj_03)
(pred_5 obj_02)
(pred_5 obj_04)
(pred_4 obj_01)
(pred_4 obj_05)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(pred_6)
(pred_1 obj_01 obj_03)
(pred_1 obj_05 obj_04)
(pred_2 obj_02)
)
(:goal
(and
(pred_1 obj_01 obj_04)
(pred_1 obj_05 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_01 obj_04) (pred_2 obj_02))
    (sometime-before  (pred_1 obj_05 obj_02) (pred_2 obj_03))
  )
)
)

; plan
1. (op_1 obj_02 obj_03)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_03)
   goals met: 0 of 2
2. (op_3 obj_01 obj_03)
   deleted: (pred_1 obj_01 obj_03) (pred_6)
   added: (pred_3 obj_01)
   goals met: 0 of 2
3. (op_1 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_04)
   goals met: 0 of 2
4. (op_2 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_1 obj_01 obj_04) (pred_6)
   goals met: 1 of 2
5. (op_3 obj_05 obj_04)
   deleted: (pred_1 obj_05 obj_04) (pred_6)
   added: (pred_3 obj_05)
   goals met: 1 of 2
6. (op_1 obj_04 obj_02)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_02)
   goals met: 1 of 2
7. (op_2 obj_05 obj_02)
   deleted: (pred_3 obj_05)
   added: (pred_1 obj_05 obj_02) (pred_6)
   goals met: 2 of 2
